PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_canDriver.c
    /* Select the clock input. The device can be clocked either by the peripheral clock or
       by the external crystal oscillator. The RM (43.5.9.7 Protocol timing, p. 1824)
       recommends the crystal clock because of lower jitter. Note, this setting must not be
       changed without adapting dependent settings below; in particular the time quantum
       must not be altered - most other timing parameter refer to it as unit.
         0: External crystal oscillator, 1: peripheral clock. */
#define CLKSRC  0
    pCanDevice->CTRL1 = pCanDevice->CTRL1 & ~CAN_CTRL1_CLKSRC_MASK | CAN_CTRL1_CLKSRC(CLKSRC);

    /* End the disabled mode, go into the freeze mode and wait for according acknowledge. */
    pCanDevice->MCR &= ~CAN_MCR_MDIS_MASK;
    #define STS_MASK_FROZEN (CAN_MCR_FRZACK_MASK | CAN_MCR_HALT_MASK | CAN_MCR_NOTRDY_MASK )
    while((pCanDevice->MCR & STS_MASK_FROZEN) != STS_MASK_FROZEN)
        ;
    #undef STS_MASK_FROZEN

    /* RM 43.4.12f and 43.4.21, Interrupt Flags 2/1/3 register (CAN_IFLAG2/1/3): We need to
       reset all interrupt flags prior to setting the number of mailboxes in use. */
    pCanDevice->IFLAG1 = CAN_IFLAG1_BUF31TO8I_MASK
                         | CAN_IFLAG1_BUF7I_MASK
                         | CAN_IFLAG1_BUF6I_MASK
                         | CAN_IFLAG1_BUF5I_MASK
                         | CAN_IFLAG1_BUF4TO1I_MASK
                         | CAN_IFLAG1_BUF0I_MASK
                         ;
    pCanDevice->IFLAG2 = CAN_IFLAG2_BUF63TO32I_MASK;
    pCanDevice->IFLAG3 = CAN_IFLAG3_BUF95TO64_MASK;

    /* For now, we don't support CAN FD. A generic configuration is difficult due to the
       different message sizes and augmented bit rates. They depend on the concrete network
       and shaping an all supporting, generic API is difficult and would likely suffer from
       reduced usability. Moreover, CAN FD would not allow using the Rx queue, which is
       most suitable for our CAN stack. */
    pCanDevice->MCR = CAN_MCR_MDIS(0)       /* For now keep device disabled. */
                      | CAN_MCR_FRZ(1)      /* During configuration, we need to stay frozen */
                      | CAN_MCR_RFEN(pCanDevConfig->isFIFOEnabled)/* Enable FIFO? Note, FIFO
                                                                     not compatible with FD */
                      | CAN_MCR_HALT(1)     /* 1: Stay in halted mode for now */
                      | CAN_MCR_WAKMSK(0)   /* No wakeup IRQ needed */
                      | CAN_MCR_SOFTRST(0)  /* No reset needed */
                      | CAN_MCR_SUPV(1)     /* No access by user mode code permitted */
                      | CAN_MCR_SLFWAK(0)   /* Self wake up: We have no implementation of low
                                               power/active mode switches */
                      | CAN_MCR_WRNEN(0)    /// @todo TBC: Do we need a warn IRQ?
                      | CAN_MCR_WAKSRC(0)   /* Wake-up source doesn't matter; we don't use
                                               wake-up for now. */
                      | CAN_MCR_SRXDIS(0)   /* Disable reception of Tx messages in other Rx
                                               mailbox? 0: No, Rx of own Tx is allowed */
                      | CAN_MCR_IRMQ(1)     /* Matching MB vs. FIFO: 1: Most natural
                                               descisions. See RM, Table 43-22, p. 1798. */
                      | CAN_MCR_DMA(0)      /* DMA not compatible with FD */
                      | CAN_MCR_PNET_EN(0)  /* Pretended network functionality doesn't
                                               matter, we don't implement a halt state. */
                      | CAN_MCR_LPRIOEN(0)  /* 0: We use priority handling by CAN ID only */
                      | CAN_MCR_AEN(1)      /* 1: Overwriting a Tx MB is possible as long as
                                               serialization has not yet started. (43.5.7.1) */
                      | CAN_MCR_FDEN(0)     /* 0: Standard CAN Protocol, 1: CAN FD */
                      | CAN_MCR_IDAM(0)     /* ID acceptance mode: 0: Mask of full length */
                      | CAN_MCR_MAXMB(pCanDevConfig->noMailboxes) /* MBs in use including
                                                                     those, whose space is
                                                                     occupied by FIFO and its
                                                                     filters. */
                      ;

    /* PE clock is the clock input chosen already before in bit CLKSRC. We use the external
       crystal i.e. 40 MHz on the board DEVKIT-MPC5748G. */
    _Static_assert( CCL_XTAL_CLK == 40000000u
                  , "Configuration of CAN driver doesn't suit for the given board"
                  );
    
    /* Get the bit timing controlling device parameters. The function call implements a
       table lookup for the supported Baud rates. */
    unsigned int PRESDIV
               , PROPSEG
               , PSEG1  
               , PSEG2;
    getBaudRateSettings(&PRESDIV, &PROPSEG, &PSEG1, &PSEG2, pCanDevConfig->baudRate);

    /* The interrupt groups for CAN transmission errors (ERRINT and ERRINIT_FAST) and for the
       bus off related errors (bus off/on ad Rx/Tx warning) are enabled by configuration.
       If the priority is above zero, then they are enabled. */
    const bool enableERRIrq = pCanDevConfig->irqGroupError.irqPrio > 0
             , enableBOffIrq = pCanDevConfig->irqGroupBusOff.irqPrio > 0;
    
    /* RM 43.5.4, p. 1795ff, and in particular Table 43-22, p. 1798f, provide the best
       explanation of the arbitration bits CTRL1[IRMQ] and CTRL2[MRP]. They control, which
       messages go into individual mailboxes and which go into the shared FIFO. Our
       strategy (IRMQ=1, MRP=1) give priority to the MBs. We can have a number of MBs for
       one particular CAN ID and have the FIFO for many more, controlled by the FIFO
       filters.
         The major weakness of the FIFO in comparison to the MB is the acceptance mask.
       Most FIFO entries don't have an individual mask. In our configuration this has no
       negative impact as we anyway set all masks to "all CAN ID bits care", i.e. such that
       we have sharp filtering for particular CAN IDs.
         In our configuration and if the client code configures the driver to use same
       Rx notification callback and same IRQ level for MBs and FIFO then there won't be a
       noticible difference between MB and FIFO - the only effect of the FIFO is the
       extension of the number of distinguishable, receivable CAN IDs. */
    pCanDevice->CTRL1 = CAN_CTRL1_PRESDIV(PRESDIV)  /* 0..255. SerClk = PEClk/(PRESDIV+1) =
                                                       8 MHz. */
                        | CAN_CTRL1_RJW(3)      /* Resync jump width=n+1, n=0..3. */
                        | CAN_CTRL1_PSEG1(PSEG1)/* PSEG1=n+1, n=0..7. */
                        | CAN_CTRL1_PSEG2(PSEG2)/* PSEG2=n+1, n=0..7. */
                        | CAN_CTRL1_BOFFMSK(enableBOffIrq? 1: 0) /* Bus off IRQ enable */
                        | CAN_CTRL1_ERRMSK(enableERRIrq? 1: 0)   /* Error IRQ enable */
                        | CAN_CTRL1_CLKSRC(CLKSRC) /* Clock: We write same value as above. */
                        | CAN_CTRL1_LPB(0)  /* Enable loop back, a test mode without I/O. */
                        | CAN_CTRL1_TWRNMSK(0)  /* Tx warning IRQ enable */
                        | CAN_CTRL1_RWRNMSK(0)  /* Rx warning IRQ enable */
                        | CAN_CTRL1_SMP(1)  /* 1: Take 3 instead of a single sample, average */
                        | CAN_CTRL1_BOFFREC(0)  /* 0: Enable automatic bus off recovery. */
                        | CAN_CTRL1_TSYN(0)     /* Reset time stamps on Rx in MB 0? */
                        | CAN_CTRL1_LBUF(0)     /* 0: We use priority handling by CAN ID */
                        | CAN_CTRL1_LOM(0)      /* Enable listen-only mode. */
                        | CAN_CTRL1_PROPSEG(PROPSEG)    /* PROPSEG=n+1, n=0..7. */
                        ;
    #undef CAN_BD_RATE
    #undef PRESDIV
    #undef PROPSEG
    #undef PSEG1
    #undef PSEG2

    /* RM 43.4.14, Control 2 register, p. 1739. */
    pCanDevice->CTRL2 = CAN_CTRL2_ERRMSK_FAST(0)    /* IRQ enable ERRINT */
                        | CAN_CTRL2_BOFFDONEMSK(enableBOffIrq? 1: 0) /* IRQ enable BOFFDONE */
                        | CAN_CTRL2_RFFN(pCanDevConfig->CTRL2_RFFN)/* Balance between FIFO
                                                                      and MBs, 43.4.14 */
                        | CAN_CTRL2_TASD(pCanDevConfig->CTRL2_TASD)/* 43.5.9.9, start time
                                                                       of arbitration */
                        | CAN_CTRL2_MRP(1)  /* 1: Consider MB before FIFO. 0: vice versa. */
                        | CAN_CTRL2_RRS(0)  /* Remote frame  handling as out of reset. */
                        | CAN_CTRL2_EACEN(0)/* Ignore RTR when matching MBs */
                        | CAN_CTRL2_TIMER_SRC(0)/* 0: Don't occupy a PID for time stamps. */
                        | CAN_CTRL2_PREXCEN(0)  /* 0: No protocol exception */
                        | CAN_CTRL2_ISOCANFDEN(1)   /* RM 43.5.9.1, p. 1813: Using ISO CAN
                                                       FD is strongly recommended. */
                        | CAN_CTRL2_EDFLTDIS(0) /* 0: Edge filter enabled, as out of reset */
                        ;

    /* Reset CAN free running timer, which is used for time stamps on received messages. */
    pCanDevice->TIMER = CAN_TIMER_TIMER(0);

    /* The global mask registers CAN_RXMGMASK, CAN_RX14MASK and CAN_RX15MASK have no effect
       because we set MCR[IRMQ] (see above). Each mailbox has its own mask, see RM
       43.4.22, p. 1749f, CAN_RXIMRn. */

    /* RM 43.4.8 Error Counter, p. 1725f, reset all error counters. */
    pCanDevice->ECR = CAN_ECR_RXERRCNT_FAST(0)
                      | CAN_ECR_TXERRCNT_FAST(0)
                      | CAN_ECR_RXERRCNT(0)
                      | CAN_ECR_TXERRCNT(0)
                      ;

