PeterVranken/DEVKIT-MPC5748G/samples/CAN/code/system/drivers/CAN/cdr_canDriver.c
        /* See RM 43.4.40, p. 1771, for the fields of the mailbox. See Table 43-8, p.
           1772ff, for the Rx mailbox status and command CODEs. */
        pMB->csWord = CAN_MBCS_EDL(0)   /* Ext. data length. Should be 0 for non-FD frames. */
                      | CAN_MBCS_BRS(0) /* Bit rate switch: Only for CAN FD */
                      | CAN_MBCS_ESI(0) /* Error active/passive. TBC: encoding unclear */
                      | CAN_MBCS_CODE(CODE)
                      | CAN_MBCS_SRR(1) /* Needs to be 1 for Tx, doesn't care for Rx */
                      | CAN_MBCS_IDE(isExtId? 1u: 0u)/* 0: Std CAN ID, 1: ext. 29 Bit CAN ID */
                      | CAN_MBCS_RTR(0) /* Needed for Remote frames, 0 for normal data fr. */
                      | CAN_MBCS_DLC(TxDLC) /* Size of frame, doesn't care for Rx. */
                      | CAN_MBCS_TIME_STAMP(0)  /* Value doesn't care is set on transmission */
                      ;
        pMB->canId = CAN_MBID_PRIO(0u)   /* We don't use the local prio value. */
                     | (isExtId? CAN_MBID_ID_EXT(canId): CAN_MBID_ID_STD(canId));
    }
    else
        return cdr_errApi_idxMailboxOutOfRange;

    return cdr_errApi_noError;

} /* End of cdr_osMakeMailboxReservation. */



/**
 * Comman part of the two APIs to send a Tx message. It checks the mailbox state and
 * prepares it for sending. It does not copy the payload and it doesn't trigger sending
 * yet.
 *   @return
 * The pointer to the affected mailbox if function succeeds, else \a NULL. The latter can
 * happen, if the buffer in the hardware is still occupied by the preceeding message, which
 * has not yet serialized on the CAN bus.\n
 *   If the function returns \a NULL then the caller must not proceed with sending.
 *   @param idxCanDevice
 * The affected CAN device (see enumeration \a cdr_canDevice_t).
 *   @param hMB
 * The mailbox to serialize onto the CAN bus is identified by the handle.
 *   @remark
 * It is permitted to call this function from the context of the notification IRQ for the
 * same message. This function can be used to implement a send queue: If it returns \a
 * false then the message is appended to the queue. The notification callback checks the
 * queue and sends the heading element - if any - using this function.
 *   @todo
 * The use case "queued sending" would be better supported by a second variant of this
 * function, which offered to specify the CAN ID (and std/ext) in each call. The basic
 * function would then no longer offer DLC: Either most simple for typical mailbox patterns
 * or full flexibility with maximum overhead.
 */
static volatile cdr_mailbox_t *osPrepareSendMessage( unsigned int idxCanDevice
                                                   , unsigned int hMB
                                                   )
{
    /* A pointer to the device in operation and its configuration is basis of the next
       steps. */
    assert(idxCanDevice < sizeOfAry(cdr_canDriverConfig));
    CAN_Type * const pDevice = cdr_mapIdxToCanDevice[idxCanDevice];
    const cdr_canDeviceConfig_t * const pDeviceConfig = &cdr_canDriverConfig[idxCanDevice];

    /* Tx is only possible with normal mailboxes. */
    const unsigned int noFIFOMsgs ATTRIB_DBG_ONLY = getNoFIFOFilterEntries(pDeviceConfig)
                     , additionalCapaFIFO = cdr_getAdditionalCapacityDueToFIFO(pDeviceConfig);
    assert(hMB >= noFIFOMsgs);

    /* hMB needs a simple transformation to become the index of the mailboxes in the
       device. */
    const unsigned int idxMB = hMB - additionalCapaFIFO;
    assert(idxMB < pDeviceConfig->noMailboxes);

    /* Get the pointer to the mailbox in use. */
    volatile cdr_mailbox_t * const pTxMB = cdr_getMailboxByIdx(pDevice, idxMB);

    /* Read status word of MB and decide whether we may send (already again). */
    const uint32_t csWord = pTxMB->csWord
                 , CODE = (csWord & CAN_MBCS_CODE_MASK) >> CAN_MBCS_CODE_SHIFT;
    if(CODE == 8 /* TX ACTIVE */)
    {
        /* The MB is basically free. There's still an important consideration. Sending may
           be done with or without IRQ notification and in either case we need to
           acknowledge the interrupt from the preceeding Tx - otherwise the MB is blocked
           (RM 43.5.1, p. 1789). If notification is enabled then there are possible race
           conditions: Will the ISR or do we here reset the flag?
             The normal usecase of Tx notifications is virtualization of MBs by buffering:
           The application code interface "sends" the message by putting it in a SW buffer
           only. On each Tx notification from the CAN driver, the next element from the
           buffer is passed on to the driver, i.e. to this function. In this use case, the
           notification IRQ will always come prior to the next call of this function and
           so the interrupt is already negated on entry into this function.
             Consequently, if we unconditionally negate the flag here, then we either do,
           what we need to do (if no Tx notification is configured) or what is useless but
           doesn't do any harm (if no Tx notification is configured and already negated the
           flag). */

        /* Unconditionally clear a possibly pending interrupt bit (RM 43.4.12/13/21, p.
           1735ff) and thereby unlock the mailbox. */
        if(idxMB < 32)
        {
            const uint32_t mask = 1u << idxMB;
            pDevice->IFLAG1 =  mask; /* Clear IRQ bit by "w1c". */
        }
        else if(idxMB < 64)
        {
            const uint32_t mask = 1u << (idxMB-32u);
            pDevice->IFLAG2 =  mask; /* Clear IRQ bit by "w1c". */
        }
        else
        {
            assert(idxMB < 96);
            const uint32_t mask = 1u << (idxMB-64u);
            pDevice->IFLAG3 =  mask; /* Clear IRQ bit by "w1c". */
        }

        /* Sending is possible, return mailbox for completion of operation. */
        return pTxMB;
    }
    else
    {
        /* Mailbox is still busy. Nothing can be done. */
        return NULL;
    }
} /* End of osPrepareSendMessage */




/**
 * Send a Tx message. This API (as opposed to cdr_osSendMessageEx()) for the simple but
 * common use case where each CAN ID is connected to one particular mailbox (or message
 * handle).\n
 *   "Sending" means placing it into the mailbox, i.e. the reserved buffer
 * in the CAN device hardware. The hardware decides autonomously, when the buffer is
 * serialized on the CAN bus. Usually, this will happen much later then the return from
 * this function. (An interrupt can be configured to get a notification when it is
 * completed. See cdr_osMakeMailboxReservation() for details.)
 *   @return
 * \a true, if function succeeded, else \a false. The latter can happen, if the buffer in
 * the hardware is still occupied by the preceeding message, which has not yet serialized
 * on the CAN bus.\n
 *   If the function returns \a false then it had no effect.
 *   @param idxCanDevice
 * The administration of messages and mailboxes is made independently for all enabled CAN
 * devices. This parameter chooses the affected CAN device.\n
 *   See enumeration \a cdr_canDevice_t (actually a zero based index) for the set of
 * possible devices. An out of range situation is caught by assertion.
 *   @param hMB
 * The message to send is identified by the handle of the mailbox it is associated with. A
 * message can be send only if it had been associated with a mailbox in the hardware, i.e.
 * a successful call of cdr_osMakeMailboxReservation() is prerequisite of using this
 * function. The handle to use here is the same as used when having done the related call
 * of cdr_osMakeMailboxReservation(). An out of range situation is caught by assertion.
 *   @param payload
 * The message content bytes to sent. The number of bytes to send is taken from the current
 * mailbox configuration. Normally, it'll be the never changed value aggreed on during the
 * reservation of the mailbox (see cdr_osMakeMailboxReservation()). However, if the
 * extended send API cdr_osSendMessageEx() is used alternatingly with this simple API then
 * the DLC will be applied, which had been set with the last recent call of the extended API.
 *   @remark
 * It is permitted to call this function from the context of the notification IRQ for the
 * same message.
 *   @remark
 * This API and cdr_osSendMessageEx() are alternatives. They access the same hardware and
 * have heavy race conditions. They must never be used at a time for one and the same
 * mailbox. Most use cases will lead to a general either or in the client code but the
 * non-overlapping over time, alternating use is permitted, too.
 */
bool cdr_osSendMessage( unsigned int idxCanDevice
                      , unsigned int hMB
                      , const uint8_t payload[]
                      )
{
    /* Check and prepare the mailbox to be used and get the pointer to it. */
    volatile cdr_mailbox_t * const pTxMB = osPrepareSendMessage(idxCanDevice, hMB);

    /* Complete send operation if preparation reports success. */
    if(pTxMB != NULL)
    {
        /* Read the status word of the mailbox. */
        const uint32_t csWord = pTxMB->csWord;

        /* Copy sent data into the mailbox. */
        const unsigned int DLC = (csWord & CAN_MBCS_DLC_MASK) >> CAN_MBCS_DLC_SHIFT;
        assert(DLC <= 8);
        memcpy((void*)&pTxMB->payload[0], payload, DLC);

        /* Changeing the C/S word in the MB initiates the transmission. See RM, Table 43-9, p.
           1775, for the Tx mailbox status and command CODEs.
             A read-modify-write is required as we must not alter the bit IDE. */
        pTxMB->csWord = csWord | CAN_MBCS_CODE(12); /* CODE doesn't need masking: 8->12 */

        /* Sending is successfully initiated. */
        return true;
    }
    else
    {
        /* Mailbox is still busy. Nothing to be done. */
        return false;
    }
} /* End of cdr_osSendMessage */



/**
 * Send a Tx message. This API (as opposed to cdr_osSendMessage()) may be used if one and
 * the same mailbox is applied to transmit messages of variable length or with varying CAN
 * ID.\n
 *   "Sending" means placing it into the mailbox, i.e. the reserved buffer
 * in the CAN device hardware. The hardware decides autonomously, when the buffer is
 * serialized on the CAN bus. Usually, this will happen much later then the return from
 * this function. (An interrupt can be configured to get a notification when it is
 * completed. See cdr_osMakeMailboxReservation() for details.)
 *   @return
 * \a true, if function succeeded, else \a false. The latter can happen, if the buffer in
 * the hardware is still occupied by the preceeding message, which has not yet serialized
 * on the CAN bus.\n
 *   If the function returns \a false then it had no effect.
 *   @param idxCanDevice
 * The administration of messages and mailboxes is made independently for all enabled CAN
 * devices. This parameter chooses the affected CAN device.\n
 *   See enumeration \a cdr_canDevice_t (actually a zero based index) for the set of
 * possible devices. An out of range situation is caught by assertion.
 *   @param hMB
 * The message to send is identified by the handle of the mailbox it is associated with. A
 * message can be send only if it had been associated with a mailbox in the hardware, i.e.
 * a successful call of cdr_osMakeMailboxReservation() is prerequisite of using this
 * function. The handle to use here is the same as used when having done the related call
 * of cdr_osMakeMailboxReservation(). An out of range situation is caught by assertion.
 *   @param isExtId
 * Standard and extended CAN IDs partly share the same space of numbers. Hence, we need the
 * additional Boolean information, which of the two the ID \a canId belongs to.
 *   @param canId
 * The standard or extended ID of the CAN message to send. See \a isExtId, too.
 *   @param DLC
 * The number of bytes to send in the range 0..8. An out of range situation is caught by
 * assertion.
 *   @param payload
 * The \a DLC message content bytes, which are sent.
 *   @remark
 * It is permitted to call this function from the context of the notification IRQ for the
 * same message. This function can be used to implement a send queue: If it returns \a
 * false then the message is appended to the queue. The notification callback checks the
 * queue and sends the heading element - if any - using this function.
 *   @remark
 * This API and cdr_osSendMessage() are alternatives. They access the same hardware and
 * have heavy race conditions. They must never be used at a time for one and the same
 * mailbox. Most use cases will lead to a general either or in the client code but the
 * non-overlapping over time, alternating use is permitted, too.
 */
bool cdr_osSendMessageEx( unsigned int idxCanDevice
                        , unsigned int hMB
                        , bool isExtId
                        , unsigned int canId
                        , unsigned int DLC
                        , const uint8_t payload[]
                        )
{
    /* Check and prepare the mailbox to be used and get the pointer to it. */
    volatile cdr_mailbox_t * const pTxMB = osPrepareSendMessage(idxCanDevice, hMB);

    /* Complete send operation if preparation reports success. */
    if(pTxMB != NULL)
    {
        /* Set the CAN ID to be used this time with the mailbox. */
        pTxMB->canId = CAN_MBID_PRIO(0u)   /* We don't use the local prio value. */
                       | (isExtId? CAN_MBID_ID_EXT(canId): CAN_MBID_ID_STD(canId));

        /* Copy sent data into the mailbox. */
        assert(DLC <= 8);
        memcpy((void*)&pTxMB->payload[0], payload, DLC);

        /* Changeing the C/S word in the MB initiates the transmission. See RM, Table 43-9, p.
           1775, for the Tx mailbox status and command CODEs. */
        pTxMB->csWord =
                CAN_MBCS_EDL(0)   /* Ext. data length. Should be 0 for non-FD frames. */
                | CAN_MBCS_BRS(0) /* Bit rate switch: Only for CAN FD */
                | CAN_MBCS_ESI(0) /* Error active/passive. TBC: encoding unclear */
                | CAN_MBCS_CODE(12)   /* 12, DATA, triggers Tx. */
                | CAN_MBCS_SRR(1) /* Needs to be 1 for Tx, doesn't care for Rx */
                | CAN_MBCS_IDE(isExtId? 1: 0) /* 0: Std CAN ID, 1: ext. 29 Bit CAN ID */
                | CAN_MBCS_RTR(0) /* Needed for Remote frames, 0 for normal data fr. */
                | CAN_MBCS_DLC(DLC) /* no FD: n=no bytes, FD: see RM, Table 43-10, p. 1777. */
                | CAN_MBCS_TIME_STAMP(0)  /* Value doesn't care if set on transmission */
                ;

        /* Sending is successfully initiated. */
        return true;
    }
    else
    {
        /* Mailbox is still busy. Nothing to be done. */
        return false;
    }
} /* End of cdr_osSendMessageEx */



/**
 * Read an Rx message from the mailbox. This is the polling based receive API of the CAN
 * driver. The contents of the mailbox are returned if a message had been received since
 * the preceding invocation of this function for the same mailbox.\n
 *   Regularly polling a mailbox is an alternative to notification of reception by
 * interrupt and callback. For a given mailbox, either technologies can't be combined. This
 * is double-checked by assertion in DEBUG compilation.
 *   @return
 * If the function returns either \a cdr_errApi_noError or \a cdr_errApi_warningRxOverflow
 * then a new message had been arrived and the mailbox contents are returned to the
 * caller.\n
 *   \a cdr_errApi_noError should be the normal case, while \a cdr_errApi_warningRxOverflow
 * indicates that the call of the function came too late to read all incoming messages; at
 * least one preceeding message had been lost and overwritten by it successor.\n
 *   If no new message had been received since the previous call of this function for the
 * same mailbox then the function returns \a cdr_errApi_rxMailboxEmpty. None of the other
 * (pointer based) function results is set in this case.
 *   @param idxCanDevice
 * The administration of messages and mailboxes is made independently for all enabled CAN
 * devices. This parameter chooses the affected CAN device.\n
 *   See enumeration \a cdr_canDevice_t (actually a zero based index) for the set of
 * possible devices. An out of range situation is caught by assertion.
 *   @param hMB
 * The message to send is identified by the handle of the mailbox it is associated with. A
 * message can be received only if it had been associated with a mailbox in the hardware, i.e.
 * a successful call of cdr_osMakeMailboxReservation() is prerequisite of using this
 * function. The handle to use here is the same as used when having done the related call
 * of cdr_osMakeMailboxReservation(). An out of range situation is caught by assertion.
 *   @param pDLC
 * At entry into this function, * \a pDLC is the size in Byte of the output buffer \a
 * payload. No more than this number of payload bytes will be returned.\n
 *   After return, the caller will find the received number of bytes in * \a pDLC.
 *   @param payload
 * The received \a DLC message content bytes are placed into this buffer.
 *   @param pTimeStamp
 * The time of reception of the message is recorded by hardware and the value is returned
 * as * \a pTimeStamp. The absolute value has not meaning, time-base is a free running 16
 * Bit counter. The frequency of the timer is the CAN bit rate; having a bus with 500 kBd
 * the unit of the timer would be 2µs. The timer wraps around at 2^16-1.\n
 *   \a pTimeStamp can be NULL if the called doesn't want to make use of the time stamp.
 */
/// @todo Remove temporary test code
unsigned int BSS_OS(cdr_test_cntMoveInClash) = 0;

cdr_errorAPI_t cdr_osReadMessage( unsigned int idxCanDevice
                                , unsigned int hMB
                                , unsigned int * const pDLC
                                , uint8_t payload[]
                                , unsigned int * const pTimeStamp
                                )
{
    /* A pointer to the device in operation and its configuration is basis of the next
       steps. */
    assert(idxCanDevice < sizeOfAry(cdr_canDriverConfig));
    CAN_Type * const pDevice = cdr_mapIdxToCanDevice[idxCanDevice];
    const cdr_canDeviceConfig_t * const pDeviceConfig = &cdr_canDriverConfig[idxCanDevice];

    /* Rx polling is only possible with normal mailboxes. */
    const unsigned int noFIFOMsgs ATTRIB_DBG_ONLY = getNoFIFOFilterEntries(pDeviceConfig)
                     , additionalCapaFIFO = cdr_getAdditionalCapacityDueToFIFO(pDeviceConfig);
    assert(hMB >= noFIFOMsgs);

